In [6]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [7]:
import numpy as np 
import pandas as pd

In [8]:
dataset_path = "./dataset.csv"

df = pd.read_csv(
    dataset_path,
    # dtype is specified to prevent a DtypeWarning
    dtype={
        "full_query": str,
        "label": int,
        "statement_type": str,
        "query_template_id": str,
        "attack_payload": str,
        "attack_id": str,
        "attack_technique": str,
        "attack_desc": str,
        "split": str,
        "sqlmap_status" : str,
        "attack_stage" : str,

    },
)

In [9]:
def display_counts_recon(df : pd.DataFrame):
    result = df.groupby('attack_id')['attack_stage'].value_counts().unstack(fill_value=0)
    display(result)
_ = display_counts_recon(df)

attack_stage  exploit  recon
attack_id
error-0           188   1243
error-1           188   1468
error-10          367    477
error-11          368    469
error-12          367    477
error-13          367    477
error-14         1179    469
error-15         1178    477
error-16          999    476
error-17         1175    477
error-18         1175    476
error-19          364    226
error-2           188   1313
error-20          364    226
error-21          364    448
error-22          364    225
error-23          365    226
error-24          188    225
error-25          188    225
error-26          188    226
error-27          188    224
error-28          188   2333
error-29          189    226
error-3           884   1581
error-30          188    447
error-31          189    225
error-32          188    225
error-33          189    226
error-34          188    447
error-35          188    225
error-36          188   2341
error-37          188    460
error-38          188    240
error-39          188   6539
error-4           884   1298
error-40          188    226
error-41          188    226
error-42           12    225
error-43           12   4446
error-5           884   1031
error-6           885    764
error-7           884   1460
error-8           884   1506
error-9           884   1459

In [10]:
_df = df.loc[(df["attack_id"] == "error-42") & (df["attack_stage"] == "exploit")]
display(_df)

,full_query,label,attack_payload,attack_desc,attack_stage,sqlmap_status,statement_type,query_template_id,attack_id,attack_technique,split
53396,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53397,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53398,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53399,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53400,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53401,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53402,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53403,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53404,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53405,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53406,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train
53407,"SELECT r.name AS region_name, COUNT(a.id) AS a...",1,NaN,NaN,exploit,success,select,airport-S16,error-42,error,train